"""
Найдите остаток при делении числа a на b.
"""

def main():
    a, b = int(input()), int(input())
    print(a % b)

if __name__ == '__main__':
    main()